zephyrproject-rtos/zephyr/include/zephyr/dt-bindings/misc/renesas/ra-elc/ra6m2-elc.h
#define RA_ELC_EVENT_SCI3_ERI                  0x189 /**< Receive error. */
#define RA_ELC_EVENT_SCI3_AM                   0x18A /**< Address match event. */
#define RA_ELC_EVENT_SCI4_RXI                  0x18C /**< Receive data full. */
#define RA_ELC_EVENT_SCI4_TXI                  0x18D /**< Transmit data empty. */
#define RA_ELC_EVENT_SCI4_TEI                  0x18E /**< Transmit end. */
#define RA_ELC_EVENT_SCI4_ERI                  0x18F /**< Receive error. */
#define RA_ELC_EVENT_SCI4_AM                   0x190 /**< Address match event. */
#define RA_ELC_EVENT_SCI5_RXI                  0x192 /**< Receive data full. */
#define RA_ELC_EVENT_SCI5_TXI                  0x193 /**< Transmit data empty. */
#define RA_ELC_EVENT_SCI5_TEI                  0x194 /**< Transmit end. */
#define RA_ELC_EVENT_SCI5_ERI                  0x195 /**< Receive error. */
#define RA_ELC_EVENT_SCI5_AM                   0x196 /**< Address match event. */
#define RA_ELC_EVENT_SCI6_RXI                  0x198 /**< Receive data full. */
#define RA_ELC_EVENT_SCI6_TXI                  0x199 /**< Transmit data empty. */
#define RA_ELC_EVENT_SCI6_TEI                  0x19A /**< Transmit end. */
#define RA_ELC_EVENT_SCI6_ERI                  0x19B /**< Receive error. */
#define RA_ELC_EVENT_SCI6_AM                   0x19C /**< Address match event. */
#define RA_ELC_EVENT_SCI7_RXI                  0x19E /**< Receive data full. */
#define RA_ELC_EVENT_SCI7_TXI                  0x19F /**< Transmit data empty. */
#define RA_ELC_EVENT_SCI7_TEI                  0x1A0 /**< Transmit end. */
#define RA_ELC_EVENT_SCI7_ERI                  0x1A1 /**< Receive error. */
#define RA_ELC_EVENT_SCI7_AM                   0x1A2 /**< Address match event. */
#define RA_ELC_EVENT_SCI8_RXI                  0x1A4 /**< Receive data full. */
#define RA_ELC_EVENT_SCI8_TXI                  0x1A5 /**< Transmit data empty. */
#define RA_ELC_EVENT_SCI8_TEI                  0x1A6 /**< Transmit end. */
#define RA_ELC_EVENT_SCI8_ERI                  0x1A7 /**< Receive error. */
#define RA_ELC_EVENT_SCI8_AM                   0x1A8 /**< Address match event. */
#define RA_ELC_EVENT_SCI9_RXI                  0x1AA /**< Receive data full. */
#define RA_ELC_EVENT_SCI9_TXI                  0x1AB /**< Transmit data empty. */
#define RA_ELC_EVENT_SCI9_TEI                  0x1AC /**< Transmit end. */
#define RA_ELC_EVENT_SCI9_ERI                  0x1AD /**< Receive error. */
#define RA_ELC_EVENT_SCI9_AM                   0x1AE /**< Address match event. */
#define RA_ELC_EVENT_SPI0_RXI                  0x1BC /**< Receive buffer full. */
#define RA_ELC_EVENT_SPI0_TXI                  0x1BD /**< Transmit buffer empty. */
#define RA_ELC_EVENT_SPI0_IDLE                 0x1BE /**< Idle. */
#define RA_ELC_EVENT_SPI0_ERI                  0x1BF /**< Error. */
#define RA_ELC_EVENT_SPI0_TEI                  0x1C0 /**< Transmission complete event. */
#define RA_ELC_EVENT_SPI1_RXI                  0x1C1 /**< Receive buffer full. */
#define RA_ELC_EVENT_SPI1_TXI                  0x1C2 /**< Transmit buffer empty. */
#define RA_ELC_EVENT_SPI1_IDLE                 0x1C3 /**< Idle. */
#define RA_ELC_EVENT_SPI1_ERI                  0x1C4 /**< Error. */
#define RA_ELC_EVENT_SPI1_TEI                  0x1C5 /**< Transmission complete event. */
#define RA_ELC_EVENT_QSPI_INT                  0x1C6 /**< QSPI interrupt. */
#define RA_ELC_EVENT_SDHIMMC0_ACCS             0x1C7 /**< Card access. */
#define RA_ELC_EVENT_SDHIMMC0_SDIO             0x1C8 /**< SDIO access. */
#define RA_ELC_EVENT_SDHIMMC0_CARD             0x1C9 /**< Card detect. */
#define RA_ELC_EVENT_SDHIMMC0_DMA_REQ          0x1CA /**< DMA transfer request. */
#define RA_ELC_EVENT_SDHIMMC1_ACCS             0x1CB /**< Card access. */
#define RA_ELC_EVENT_SDHIMMC1_SDIO             0x1CC /**< SDIO access. */
#define RA_ELC_EVENT_SDHIMMC1_CARD             0x1CD /**< Card detect. */
#define RA_ELC_EVENT_SDHIMMC1_DMA_REQ          0x1CE /**< DMA transfer request. */

/* Renesas RA ELC peripherals that can be linked to event signals. */
#define RA_ELC_PERIPHERAL_GPT_A   0  /**< General PWM Timer A */
#define RA_ELC_PERIPHERAL_GPT_B   1  /**< General PWM Timer B */
#define RA_ELC_PERIPHERAL_GPT_C   2  /**< General PWM Timer C */
#define RA_ELC_PERIPHERAL_GPT_D   3  /**< General PWM Timer D */
#define RA_ELC_PERIPHERAL_GPT_E   4  /**< General PWM Timer E */
#define RA_ELC_PERIPHERAL_GPT_F   5  /**< General PWM Timer F */
#define RA_ELC_PERIPHERAL_GPT_G   6  /**< General PWM Timer G */
#define RA_ELC_PERIPHERAL_GPT_H   7  /**< General PWM Timer H */
#define RA_ELC_PERIPHERAL_ADC0    8  /**< ADC0 */
#define RA_ELC_PERIPHERAL_ADC0_B  9  /**< ADC0 Group B */
#define RA_ELC_PERIPHERAL_ADC1    10 /**< ADC1 */
#define RA_ELC_PERIPHERAL_ADC1_B  11 /**< ADC1 Group B */
#define RA_ELC_PERIPHERAL_DAC0    12 /**< DAC0 */
#define RA_ELC_PERIPHERAL_DAC1    13 /**< DAC1 */
#define RA_ELC_PERIPHERAL_IOPORT1 14 /**< IOPORT1 */
#define RA_ELC_PERIPHERAL_IOPORT2 15 /**< IOPORT2 */
#define RA_ELC_PERIPHERAL_IOPORT3 16 /**< IOPORT3 */
#define RA_ELC_PERIPHERAL_IOPORT4 17 /**< IOPORT4 */
#define RA_ELC_PERIPHERAL_CTSU    18 /**< CTSU */

/** @endcond */

/** @} */

#endif /* ZEPHYR_INCLUDE_DT_BINDINGS_MISC_RENESAS_RA_ELC_RA6M2_ELC_H_ */
